2017-01-28-org-reveal-ipython.org
#+Title: Using Reveal and Ipython in Orgmode
#+Author: Ney Lemke
#+Email: lemke@ibb.unesp.br

#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800
#+OPTIONS: toc:1
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_TRANS: cube
#+REVEAL_THEME: moon
#+REVEAL_HLEVEL: 2
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Org-Reveal Introduction.">
#+REVEAL_POSTAMBLE: <p> Created by Ney Lemke. </p>
#+REVEAL_PLUGINS: (markdown notes)
#+REVEAL_EXTRA_CSS: ./local.css
#+REVEAL_ROOT: /reveal.js 
#+bind: org-export-publishing-directory "/Users/neylemke/Dropbox/laptop/bloggithub/LessOrMore-master/_posts"

* Pre-Installation

** Environment

We will that assume the user has already installed these tools:

- emacs
- spacemacs http://https://github.com/syl20bnr/spacemacs
- orgmode http://http://orgmode.org
- latex
- anaconda https://www.continuum.io/downloads
- jupyter http://http://jupyter.org

* Instalation

** Python
We will need  to install some python packages to start

#+BEGIN_SRC sh
conda install jupyter_console 
conda install jupyter_client
conda install tornado
conda update ipython
#+END_SRC

** Emacs
We will also need to install some packages on emacs: =ob-python= https://github.com/gregsexton/ob-ipython 
and =ox-reveal= https://github.com/yjwen/org-reveal. I
have edit .spacemacs. I included a line on layer-config section

#+BEGIN_SRC elisp
org (org :variables
              org-enable-reveal-js-support t
              org-enable-github-support t)
#+END_SRC

*** Emacs

I also included some languages to use on babel

#+BEGIN_SRC 

(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (latex . t)
   (shell . t)
   (ipython . t)
   (lisp . t)
   ))
)
#+END_SRC

*** Emacs
I also included  aditional packages on layer configuration file:
=~/.emacs.d/layers/+emacs/org/packages.el=. I include =ob-ipython=
on the packages variable and included a new function:

#+BEGIN_SRC lisp
(defun org/init-ob-ipython ()
    (use-package ob-ipython
     :defer t))                          
#+END_SRC 


